# Brewfile for Mac Setup
# Install with: brew bundle install

# Taps

# Programming Languages
brew "node"
brew "oven-sh/bun/bun"
brew "php@8.4"
brew "go"
brew "rust"
cask "powershell"

# Text Editors
cask "zed"
cask "visual-studio-code@insiders"

# Development Tools
brew "git"
brew "gh"
cask "github"
brew "chezmoi"
brew "lazygit"

# Infrastructure & Cloud Tools
brew "awscli"
brew "vultr"
brew "doctl"
cask "gcloud-cli"
brew "azure-cli"
brew "oci-cli"
brew "linode-cli"
brew "cloudflare-cli4"
cask "1password-cli"

# Infrastructure as Code & Configuration Management
brew "opentofu"
brew "ansible"

# Kubernetes Tools
brew "kubectl"
brew "helm"
brew "k9s"

# Security & Vulnerability Scanning
brew "trivy"
brew "grype"

# CI/CD & DevOps
brew "act"

# CLI Tools
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"
brew "curl"
brew "wget"
brew "shellcheck"
brew "shfmt"
brew "uv"
cask "rar"

# Mac App Store CLI
brew "mas"

# Docker
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# Android Development
cask "android-commandlinetools"

# Java Runtime
cask "temurin"

# Terminal & Shell
cask "warp"

# Communication & Collaboration
cask "claude"
cask "discord"
cask "slack"

# Password & Security
cask "1password"
cask "proton-mail"
cask "protonvpn"
cask "tailscale-app"

# Media & Entertainment
cask "iina"
cask "parsec"

# File Management
cask "the-unarchiver"
cask "filen"

# Productivity
cask "raycast"
cask "shottr"
cask "insomnia"
cask "gitkraken"
cask "raspberry-pi-imager"
cask "elgato-camera-hub"
cask "orcaslicer"
cask "applite"
cask "appcleaner"
cask "dockdoor"

# System Enhancement
cask "jordanbaird-ice@beta"

# Web Browsers
cask "google-chrome"

# Database Tools
cask "beekeeper-studio"
cask "datagrip"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store Applications
#mas "Infuse 7", id: 1136220934
#mas "Magnet", id: 441258766
#mas "Unsplash Wallpapers", id: 1284863847
#mas "HP Print and Support", id: 1474276998
# mas "UHF - Love Your IPTV", id: 6443751726 # iPadOS App not supported currently via mas-cli
#mas "Amphetamine", id: 937984704
#mas "Paste - Limitless Clipboard", id: 967805235