# Brewfile for Mac Setup
# Install with: brew bundle install

# Taps
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

# Programming Languages
brew "node"
brew "bun"
brew "php@8.4"
brew "go"
brew "rust"
brew "powershell"

# Development Tools
brew "git"
brew "gh"
brew "github"
brew "chezmoi"
brew "lazygit"
brew "awscli"
brew "vultr"
brew "doctl"
brew "gcloud-cli"
brew "azure-cli"
brew "oci-cli"
brew "linode-cli"
brew "cloudflare-cli"
brew "1password-cli"

# Infrastructure as Code & Configuration Management
brew "terraform"
brew "ansible"
brew "packer"

# Kubernetes Tools
brew "kubectl"
brew "helm"
brew "k9s"

# Security & Vulnerability Scanning
brew "trivy"
brew "grype"

# CI/CD & DevOps
brew "act"

# CLI Tools
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"
brew "curl"
brew "wget"
brew "shellcheck"
brew "shfmt"
brew "uv"
brew "rar"

# Mac App Store CLI
brew "mas"

# Android Development
brew "android-commandlinetools"

# Java Runtime
brew "temurin"

# Cask Applications
cask "warp"
cask "visual-studio-code@insiders"
cask "claude"
cask "raycast"
cask "1password"
cask "tailscale"
cask "docker"
cask "iina"
cask "discord"
cask "the-unarchiver"
cask "gitkraken"
cask "proton-mail"
cask "proton-vpn"
cask "filen"
cask "shotrr"
cask "insomnia"
cask "google-chrome"
cask "slack"
cask "parsec"
cask "raspberry-pi-imager"
cask "elgato-camera-hub"
cask "orcaslicer"
cask "applite"
cask "jordanbaird-ice@beta"
cask "appcleaner"
cask "dockdoor"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Database Tools
cask "beekeeper-studio"
cask "datagrip"

# Mac App Store Applications
mas "Infuse 7", id: 1136220934
mas "Magnet", id: 441258766
mas "Unsplash Wallpapers", id: 1284863847
mas "HP Print and Support", id: 1474276998
mas "UHF Love Your IPTV", id: 6443751726
mas "Amphetamine", id: 937984704
mas "Paste - Limitless Clipboard", id: 967805235