# Brewfile for Mac Setup
# Install with: brew bundle install

# Taps
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

# Programming Languages
brew "node"
brew "bun"
brew "php@8.4"
brew "go"
brew "rust"

# Development Tools
brew "git"
brew "gh"
brew "chezmoi"

# CLI Tools
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"
brew "curl"
brew "wget"
brew "shellcheck"
brew "shfmt"
brew "uv"

# Mac App Store CLI
brew "mas"

# Cask Applications
cask "warp"
cask "visual-studio-code@insiders"
cask "claude"
cask "raycast"
cask "1password"
cask "tailscale"
cask "docker"
cask "iina"
cask "discord"
cask "the-unarchiver"
cask "gitkraken"
cask "proton-mail"
cask "proton-vpn"
cask "filen"
cask "shotrr"
cask "postman"
cask "google-chrome"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Mac App Store Applications
mas "Infuse 7", id: 1136220934
mas "Magnet", id: 441258766
mas "Unsplash Wallpapers", id: 1284863847